/*******************************************************************************************
 *
 * Лабораторная работа N1 по дисциплине "Модели Решения Задач в Интеллектуальных Системах"
 * выполнено студентом БГУИР группы 721703
 * Клюевым Александром Алексеевичем
 *
 * Главная функция програмы, создающая объект Controller и запускающая программую
 *
 * версия 1.0
 *
 *******************************************************************************************/
#include <QApplication>
#include <iostream>
#include <vector>
#include <thread>

#include "controller.h"


int main(int argc, char** argv) {
    QApplication app(argc, argv);
    Controller control;

    return app.exec();
}
