/*******************************************************************************************
 *
 * Лабораторная работа N2 по дисциплине "Модели Решения Задач в Интеллектуальных Системах"
 * выполнено студентом БГУИР группы 721703
 * Клюевым Александром Алексеевичем
 * 
 * Элемент ввода в модели ОКМД.
 *
 * версия 1.0
 *
 *******************************************************************************************/
#ifndef SIMD_INPUT_UNIT_C
#define SIMD_INPUT_UNIT_C

#include "io.h"

int inputInteger()
{
    int integer;
    scanf("%d", &integer);
    return integer;
}

#endif //SIMD_INPUT_UNIT_C