/*******************************************************************************************
 *
 * Лабораторная работа N2 по дисциплине "Модели Решения Задач в Интеллектуальных Системах"
 * выполнено студентом БГУИР группы 721703
 * Клюевым Александром Алексеевичем
 * 
 * Заголовочный файл для элементов ввода и вывода данных в консоли в модели ОКМД.
 * Элементы введены для приближения модели к эмуляции машины и условной инкапсуляции
 * некоторых полей библиотеки stdio.h
 *
 * версия 1.0
 *
 *******************************************************************************************/
#ifndef SIMD_IO_H
#define SIMD_IO_H

#include <stdio.h>

#endif // SIMD_IO_H